// 11_1  2 завдання
// Створити додаток з допомогою якого можна ввести координати точки (x, y) і визначити,
// чи попадає введена точка в заштриховану область на малюнку, що поданий. 
// Влучення на границю області вважати влученням в область.
// 13 варіант

#include <iostream>
#include <math.h>
#include <Windows.h>

using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    
    double x, y, R;
    cout << "x = ";
    cin >> x;
    cout << "y = ";
    cin >> y;
    cout << "R = ";
    cin >> R;

    if (x > 0 && abs(x) <= R && y > 0 && abs(y) <= R)
        cout << "Точка попадає у зафарбовану область";

    else if (x < 0 && abs(x) <= R && y > 0 && abs(y) <= R && y <= R - x)
        cout << "Точка попадає у зафарбовану область";

    else if (x < 0 && abs(x) <= R && y < 0 && abs(y) <= R)
        cout << "Точка попадає у зафарбовану область";

    else if (x > 0 && abs(x) <= R && y < 0 && abs(y) <= R)
        cout << "Точка попадає у зафарбовану область";

    else if (x == 0 && y == 0)
        cout << "Точка попадає у зафарбовану область";

    else 
        cout << "Точка не попадає у зафарбовану область";

    return 0;

}

